jankaluza/qsimkit/QSimKit/MCU/MSP430/CPU/Variants/msp430x11x.cpp
		unsigned int getTBCTL() {
#ifdef TBCTL_
			return TBCTL_;
#else
			return 0;
#endif
		}


		unsigned int getTBCCR0() {
#ifdef TBCCR0_
			return TBCCR0_;
#else
			return 0;
#endif
		}


		unsigned int getTBCCR1() {
#ifdef TBCCR1_
			return TBCCR1_;
#else
			return 0;
#endif
		}


		unsigned int getTBCCR2() {
#ifdef TBCCR2_
			return TBCCR2_;
#else
			return 0;
#endif
		}


		unsigned int getTBCCR3() {
#ifdef TBCCR3_
			return TBCCR3_;
#else
			return 0;
#endif
		}


		unsigned int getTBCCR4() {
#ifdef TBCCR4_
			return TBCCR4_;
#else
			return 0;
#endif
		}


		unsigned int getTBCCR5() {
#ifdef TBCCR5_
			return TBCCR5_;
#else
			return 0;
#endif
		}


		unsigned int getTBCCR6() {
#ifdef TBCCR6_
			return TBCCR6_;
#else
			return 0;
#endif
		}


		unsigned int getTBCCTL0() {
#ifdef TBCCTL0_
			return TBCCTL0_;
#else
			return 0;
#endif
		}


		unsigned int getTBCCTL1() {
#ifdef TBCCTL1_
			return TBCCTL1_;
#else
			return 0;
#endif
		}


		unsigned int getTBCCTL2() {
#ifdef TBCCTL2_
			return TBCCTL2_;
#else
			return 0;
#endif
		}


		unsigned int getTBCCTL3() {
#ifdef TBCCTL3_
			return TBCCTL3_;
#else
			return 0;
#endif
		}


		unsigned int getTBCCTL4() {
#ifdef TBCCTL4_
			return TBCCTL4_;
#else
			return 0;
#endif
		}


		unsigned int getTBCCTL5() {
#ifdef TBCCTL5_
			return TBCCTL5_;
#else
			return 0;
#endif
		}


		unsigned int getTBCCTL6() {
#ifdef TBCCTL6_
			return TBCCTL6_;
#else
			return 0;
#endif
		}


		unsigned int getTBIV() {
#ifdef TBIV_
			return TBIV_;
#else
			return 0;
#endif
		}


		unsigned int getTIMERB0_VECTOR() {
#ifdef TIMERB0_VECTOR
			return TIMERB0_VECTOR;
#else
			return 0;
#endif
		}


		unsigned int getTIMERB1_VECTOR() {
#ifdef TIMERB1_VECTOR
			return TIMERB1_VECTOR;
#else
			return 0;
#endif
		}


		unsigned int getINTVECT() {
#ifdef INTVECT
			return INTVECT;
#else
			return 0;
#endif
		}


		unsigned int getUSISR() {
#ifdef USISR_
			return USISR_;
#else
			return 0;
#endif
		}


		unsigned int getUSICTL() {
#ifdef USICTL_
			return USICTL_;
#else
			return 0;
#endif
		}


		unsigned int getUSICCTL() {
#ifdef USICCTL_
			return USICCTL_;
#else
			return 0;
#endif
		}


		unsigned int getUSI_VECTOR() {
#ifdef USI_VECTOR
			return USI_VECTOR;
#else
			return 0;
#endif
		}


		unsigned int getUCA0CTL0() {
#ifdef UCA0CTL0_
			return UCA0CTL0_;
#else
			return 0;
#endif
		}


		unsigned int getUCA0CTL1() {
#ifdef UCA0CTL1_
			return UCA0CTL1_;
#else
			return 0;
#endif
		}


		unsigned int getUCA0BR0() {
#ifdef UCA0BR0_
			return UCA0BR0_;
#else
			return 0;
#endif
		}


		unsigned int getUCA0BR1() {
#ifdef UCA0BR1_
			return UCA0BR1_;
#else
			return 0;
#endif
		}


		unsigned int getUCA0MCTL() {
#ifdef UCA0MCTL_
			return UCA0MCTL_;
#else
			return 0;
#endif
		}


		unsigned int getUCA0STAT() {
#ifdef UCA0STAT_
			return UCA0STAT_;
#else
			return 0;
#endif
		}


		unsigned int getUCA0RXBUF() {
#ifdef UCA0RXBUF_
			return UCA0RXBUF_;
#else
			return 0;
#endif
		}


		unsigned int getUCA0TXBUF() {
#ifdef UCA0TXBUF_
			return UCA0TXBUF_;
#else
			return 0;
#endif
		}


		unsigned int getUCA0ABCTL() {
#ifdef UCA0ABCTL_
			return UCA0ABCTL_;
#else
			return 0;
#endif
		}


		unsigned int getUCA0IRTCTL() {
#ifdef UCA0IRTCTL_
			return UCA0IRTCTL_;
#else
			return 0;
#endif
		}


		unsigned int getUCA0IRRCTL() {
#ifdef UCA0IRRCTL_
			return UCA0IRRCTL_;
#else
			return 0;
#endif
		}


		unsigned int getUCB0CTL0() {
#ifdef UCB0CTL0_
			return UCB0CTL0_;
#else
			return 0;
#endif
		}


		unsigned int getUCB0CTL1() {
#ifdef UCB0CTL1_
			return UCB0CTL1_;
#else
			return 0;
#endif
		}


		unsigned int getUCB0BR0() {
#ifdef UCB0BR0_
			return UCB0BR0_;
#else
			return 0;
#endif
		}


		unsigned int getUCB0BR1() {
#ifdef UCB0BR1_
			return UCB0BR1_;
#else
			return 0;
#endif
		}


		unsigned int getUCB0MCTL() {
#ifdef UCB0MCTL_
			return UCB0MCTL_;
#else
			return 0;
#endif
		}


		unsigned int getUCB0I2CIE() {
#ifdef UCB0I2CIE_
			return UCB0I2CIE_;
#else
			return 0;
#endif
		}


		unsigned int getUCB0STAT() {
#ifdef UCB0STAT_
			return UCB0STAT_;
#else
			return 0;
#endif
		}


		unsigned int getUCB0RXBUF() {
#ifdef UCB0RXBUF_
			return UCB0RXBUF_;
#else
			return 0;
#endif
		}


		unsigned int getUCB0TXBUF() {
#ifdef UCB0TXBUF_
			return UCB0TXBUF_;
#else
			return 0;
#endif
		}


		unsigned int getUCB0I2COA() {
#ifdef UCB0I2COA_
			return UCB0I2COA_;
#else
			return 0;
#endif
		}


		unsigned int getUCB0I2CSA() {
#ifdef UCB0I2CSA_
			return UCB0I2CSA_;
#else
			return 0;
#endif
		}


		unsigned int getUSCIAB0TX_VECTOR() {
#ifdef USCIAB0TX_VECTOR
			return USCIAB0TX_VECTOR;
#else
			return 0;
#endif
		}


		unsigned int getUSCIAB0RX_VECTOR() {
#ifdef USCIAB0RX_VECTOR
			return USCIAB0RX_VECTOR;
#else
			return 0;
#endif
		}


		unsigned int getUCA1CTL0() {
#ifdef UCA1CTL0_
			return UCA1CTL0_;
#else
			return 0;
#endif
		}


		unsigned int getUCA1CTL1() {
#ifdef UCA1CTL1_
			return UCA1CTL1_;
#else
			return 0;
#endif
		}


		unsigned int getUCA1BR0() {
#ifdef UCA1BR0_
			return UCA1BR0_;
#else
			return 0;
#endif
		}


		unsigned int getUCA1BR1() {
#ifdef UCA1BR1_
			return UCA1BR1_;
#else
			return 0;
#endif
		}


		unsigned int getUCA1MCTL() {
#ifdef UCA1MCTL_
			return UCA1MCTL_;
#else
			return 0;
#endif
		}


		unsigned int getUCA1STAT() {
#ifdef UCA1STAT_
			return UCA1STAT_;
#else
			return 0;
#endif
		}


		unsigned int getUCA1RXBUF() {
#ifdef UCA1RXBUF_
			return UCA1RXBUF_;
#else
			return 0;
#endif
		}


		unsigned int getUCA1TXBUF() {
#ifdef UCA1TXBUF_
			return UCA1TXBUF_;
#else
			return 0;
#endif
		}


		unsigned int getUCA1ABCTL() {
#ifdef UCA1ABCTL_
			return UCA1ABCTL_;
#else
			return 0;
#endif
		}


		unsigned int getUCA1IRTCTL() {
#ifdef UCA1IRTCTL_
			return UCA1IRTCTL_;
#else
			return 0;
#endif
		}


		unsigned int getUCA1IRRCTL() {
#ifdef UCA1IRRCTL_
			return UCA1IRRCTL_;
#else
			return 0;
#endif
		}


		unsigned int getUCB1CTL0() {
#ifdef UCB1CTL0_
			return UCB1CTL0_;
#else
			return 0;
#endif
		}


		unsigned int getUCB1CTL1() {
#ifdef UCB1CTL1_
			return UCB1CTL1_;
#else
			return 0;
#endif
		}


		unsigned int getUCB1BR0() {
#ifdef UCB1BR0_
			return UCB1BR0_;
#else
			return 0;
#endif
		}


		unsigned int getUCB1BR1() {
#ifdef UCB1BR1_
			return UCB1BR1_;
#else
			return 0;
#endif
		}


		unsigned int getUCB1I2CIE() {
#ifdef UCB1I2CIE_
			return UCB1I2CIE_;
#else
			return 0;
#endif
		}


		unsigned int getUCB1STAT() {
#ifdef UCB1STAT_
			return UCB1STAT_;
#else
			return 0;
#endif
		}


		unsigned int getUCB1RXBUF() {
#ifdef UCB1RXBUF_
			return UCB1RXBUF_;
#else
			return 0;
#endif
		}


		unsigned int getUCB1TXBUF() {
#ifdef UCB1TXBUF_
			return UCB1TXBUF_;
#else
			return 0;
#endif
		}


		unsigned int getUCB1I2COA() {
#ifdef UCB1I2COA_
			return UCB1I2COA_;
#else
			return 0;
#endif
		}


		unsigned int getUCB1I2CSA() {
#ifdef UCB1I2CSA_
			return UCB1I2CSA_;
#else
			return 0;
#endif
		}


		unsigned int getUSCIAB1TX_VECTOR() {
#ifdef USCIAB1TX_VECTOR
			return USCIAB1TX_VECTOR;
#else
			return 0;
#endif
		}


		unsigned int getUSCIAB1RX_VECTOR() {
#ifdef USCIAB1RX_VECTOR
			return USCIAB1RX_VECTOR;
#else
			return 0;
#endif
		}


		unsigned int getUC0IE() {
#ifdef UC0IE
			return UC0IE;
#else
			return 0;
#endif
		}


		unsigned int getUC0IFG() {
#ifdef UC0IFG
			return UC0IFG;
#else
			return 0;
#endif
		}


		unsigned int getUC1IE() {
#ifdef UC1IE
			return UC1IE;
#else
			return 0;
#endif
		}


		unsigned int getUC1IFG() {
#ifdef UC1IFG
			return UC1IFG;
#else
			return 0;
#endif
		}


		double getSRSEL() {
#ifdef SRSEL
			return SRSEL;
#else
			return 0;
#endif
		}


		double getSDCO() {
#ifdef SDCO
			return SDCO;
#else
			return 0;
#endif
		}


		double getDCOZERO() {
#ifdef DCOZERO
			return DCOZERO;
#else
			return 0;
#endif
		}


};

MSP430_VARIANT("msp430x11x", msp430x11x);

